# **# Question 1 : Explain the fundamental differences between DDL, DML, and DQL**
# **commands in SQL. Provide one example for each type of command.**

Here‚Äôs a clear breakdown of the **fundamental differences between DDL, DML, and DQL** in SQL, along with examples for each:

---

### **1. DDL (Data Definition Language)**

**Purpose:**
DDL commands are used to **define, modify, or remove the structure of database objects** such as tables, schemas, or indexes.

**Key Characteristics:**

* Deal with database structure, not the data itself
* Changes are usually permanent (auto-commit in most DBMSs)

**Common DDL Commands:** `CREATE`, `ALTER`, `DROP`, `TRUNCATE`

**Example:**

```sql
CREATE TABLE Students (
    StudentID INT,
    Name VARCHAR(50),
    Age INT
);
```

---

### **2. DML (Data Manipulation Language)**

**Purpose:**
DML commands are used to **insert, update, or delete data** stored in database tables.

**Key Characteristics:**

* Operate on the data inside tables
* Changes can usually be rolled back (transaction-controlled)

**Common DML Commands:** `INSERT`, `UPDATE`, `DELETE`

**Example:**

```sql
INSERT INTO Students (StudentID, Name, Age)
VALUES (1, 'Alice', 20);
```

---

### **3. DQL (Data Query Language)**

**Purpose:**
DQL commands are used to **retrieve data from the database** without modifying it.

**Key Characteristics:**

* Read-only operations
* Focused on querying and filtering data

**Common DQL Command:** `SELECT`

**Example:**

```sql
SELECT Name, Age
FROM Students
WHERE Age > 18;
```

---

### **Summary Table**

| Type | Full Form                  | Main Function              | Example Command |
| ---- | -------------------------- | -------------------------- | --------------- |
| DDL  | Data Definition Language   | Defines database structure | `CREATE`        |
| DML  | Data Manipulation Language | Modifies data              | `INSERT`        |
| DQL  | Data Query Language        | Retrieves data             | `SELECT`        |

---

If you want, I can also give a **real-world analogy** or **exam-ready short answer** version üëç

# **Question 2 : What is the purpose of SQL constraints? Name and describe three common types**
of constraints, providing a simple scenario where each would be useful.

### **Purpose of SQL Constraints**

SQL constraints are used to **enforce rules on the data in a table** to ensure **data accuracy, consistency, and integrity**. They prevent invalid data from being inserted, updated, or deleted, helping maintain a reliable database.

---

### **Three Common Types of SQL Constraints**

#### **1. PRIMARY KEY**

**Description:**

* Uniquely identifies each record in a table
* Cannot contain `NULL` values
* Ensures entity integrity

**Scenario:**
In a **Students** table, each student must have a unique ID.

**Example:**

```sql
StudentID INT PRIMARY KEY
```

---

#### **2. FOREIGN KEY**

**Description:**

* Establishes a relationship between two tables
* Ensures that a value in one table exists in another table
* Maintains referential integrity

**Scenario:**
In an **Orders** table, each order must be linked to an existing customer in the **Customers** table.

**Example:**

```sql
CustomerID INT,
FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
```

---

#### **3. NOT NULL**

**Description:**

* Ensures that a column cannot have empty (`NULL`) values
* Forces mandatory data entry

**Scenario:**
In an **Employees** table, every employee must have a name.

**Example:**

```sql
EmployeeName VARCHAR(50) NOT NULL
```

---

### **Summary Table**

| Constraint  | Purpose                     | Example Use Case   |
| ----------- | --------------------------- | ------------------ |
| PRIMARY KEY | Uniquely identifies records | Student ID         |
| FOREIGN KEY | Links related tables        | Orders ‚Üí Customers |
| NOT NULL    | Prevents missing values     | Employee name      |

---

If you‚Äôd like, I can also explain **UNIQUE**, **CHECK**, or **DEFAULT** constraints with examples.

# **Question 3 : Explain the difference between LIMIT and OFFSET clauses in SQL. How**
would you use them together to retrieve the third page of results, assuming each page
has 10 records?

### **Difference Between `LIMIT` and `OFFSET` in SQL**

#### **LIMIT**

* Specifies **how many records** to return in the result set.
* Controls the **page size**.

#### **OFFSET**

* Specifies **how many records to skip** before starting to return rows.
* Controls **where the result set starts**.

---

### **Using LIMIT and OFFSET Together (Pagination)**

When displaying data in pages:

* `LIMIT` = number of records per page
* `OFFSET` = number of records to skip

---

### **Retrieving the 3rd Page (10 Records per Page)**

**Step-by-step logic:**

* Page size = 10 records
* Page number = 3
* Records to skip = (3 ‚àí 1) √ó 10 = **20**

**SQL Query Example:**

```sql
SELECT *
FROM Employees
ORDER BY EmployeeID
LIMIT 10 OFFSET 20;
```

---

### **Explanation**

* `OFFSET 20` skips the first 20 records (pages 1 and 2)
* `LIMIT 10` retrieves the next 10 records (page 3)

---

### **Quick Formula**

```text
OFFSET = (page_number ‚àí 1) √ó page_size
```

---

If you want, I can also show how this works in **MySQL**, **PostgreSQL**, or **SQL Server** syntax specifically.

# **Question 4 : What is a Common Table Expression (CTE) in SQL, and what are it**s main
# **benefits? Provide a simple SQL example demonstrating its usage.**

### **What is a Common Table Expression (CTE)?**

A **Common Table Expression (CTE)** is a **temporary, named result set** defined within the execution of a single SQL statement. It is created using the `WITH` keyword and can be referenced like a table in the main query.

A CTE **exists only for the duration of the query** and is not stored permanently in the database.

---

### **Main Benefits of Using CTEs**

1. **Improves Readability**

   * Makes complex queries easier to understand by breaking them into logical parts.

2. **Simplifies Complex Queries**

   * Especially useful for queries with multiple joins or subqueries.

3. **Supports Recursive Queries**

   * Enables operations like hierarchical data traversal (e.g., employee‚Äìmanager relationships).

4. **Reusability Within a Query**

   * The CTE can be referenced multiple times in the same query.

---

### **Simple SQL Example Using a CTE**

**Scenario:**
Retrieve employees whose salary is above the average salary.

```sql
WITH AvgSalary AS (
    SELECT AVG(Salary) AS AverageSalary
    FROM Employees
)
SELECT EmployeeName, Salary
FROM Employees
WHERE Salary > (SELECT AverageSalary FROM AvgSalary);
```

---

### **Explanation**

* The CTE `AvgSalary` calculates the average salary.
* The main query uses the CTE result to filter employees earning above average.

---

### **Key Point to Remember**

* CTEs improve **clarity and maintainability**, but they **do not store data permanently**.

If you want, I can also show a **recursive CTE example** or compare CTEs with **subqueries and views**.

# **Question 5 : Describe the concept of SQL Normalization and its primary goals. Briefly**
# **explain the first three normal forms (1NF, 2NF, 3NF).**

### **What is SQL Normalization?**

**SQL Normalization** is the process of **organizing data in a database** to minimize redundancy and dependency by dividing large tables into smaller, related tables and defining proper relationships between them.

---

### **Primary Goals of Normalization**

1. **Reduce data redundancy** (avoid duplicate data)
2. **Improve data integrity and consistency**
3. **Eliminate update, insert, and delete anomalies**
4. **Make the database structure easier to maintain**

---

### **First Three Normal Forms**

#### **1. First Normal Form (1NF)**

**Rule:**

* Each column must contain **atomic (indivisible) values**
* No repeating groups or multi-valued attributes
* Each record must be uniquely identifiable

**Example:**
‚ùå Not in 1NF:

| StudentID | Subjects      |
| --------- | ------------- |
| 1         | Math, Science |

‚úî In 1NF (split into rows):

| StudentID | Subject |
| --------- | ------- |
| 1         | Math    |
| 1         | Science |

---

#### **2. Second Normal Form (2NF)**

**Rule:**

* Must already be in **1NF**
* All non-key attributes must be **fully dependent on the entire primary key**
* No partial dependency (applies mainly to composite keys)

**Example:**
If a table has a composite key `(StudentID, CourseID)`:

* `StudentName` depends only on `StudentID` ‚Üí partial dependency ‚ùå

**Solution:**
Move `StudentName` to a separate **Students** table.

---

#### **3. Third Normal Form (3NF)**

**Rule:**

* Must already be in **2NF**
* No **transitive dependency** (non-key attributes should not depend on other non-key attributes)

**Example:**

| EmployeeID | DeptID | DeptName |
| ---------- | ------ | -------- |

* `DeptName` depends on `DeptID`, not directly on `EmployeeID` ‚ùå

**Solution:**
Create a separate **Departments** table:

* `Departments(DeptID, DeptName)`

---

### **Summary Table**

| Normal Form | Key Requirement          | Problem Eliminated  |
| ----------- | ------------------------ | ------------------- |
| 1NF         | Atomic values            | Repeating groups    |
| 2NF         | Full key dependency      | Partial dependency  |
| 3NF         | No transitive dependency | Indirect dependency |

---

### **In Short**

Normalization helps design **efficient, reliable databases** by structuring data logically and reducing redundancy.

If you want, I can also explain **BCNF** or show a **before-and-after normalization example** for clarity.

# **Question 6 : Create a database named ECommerceDB and perform the following**
# **tasks:**

1. Create the following tables with appropriate data types and constraints:
‚óè Categories
‚óã CategoryID (INT, PRIMARY KEY)
‚óã CategoryName (VARCHAR(50), NOT NULL, UNIQUE)

# **‚óè Products**
# ‚óã ProductID (INT, PRIMARY KEY)
# ‚óã ProductName (VARCHAR(100), NOT NULL, UNIQUE)
# ‚óã CategoryID (INT, FOREIGN KEY ‚Üí Categories)
# ‚óã Price (DECIMAL(10,2), NOT NULL)
# ‚óã StockQuantity (INT)

Below is a **complete SQL solution** that:

1. **Creates all four tables** with appropriate data types and constraints
2. **Inserts the given records into the `Categories` table**

---

## **1. Create Tables**

```sql
-- Categories table
CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- Products table
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- Customers table
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

-- Orders table
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);
```

---

## **2. Insert Records into `Categories` Table**

```sql
INSERT INTO Categories (CategoryID, CategoryName) VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');
```

---

### ‚úÖ Notes

* All **PRIMARY KEY**, **UNIQUE**, and **FOREIGN KEY** constraints are applied correctly.
* Foreign keys ensure **referential integrity** between tables.
* The schema is **normalized** and ready for inserting products, customers, and orders.

If you want, I can also:

* Insert **sample data** for Products, Customers, and Orders
* Add **CHECK** or **DEFAULT** constraints
* Write **SELECT queries** based on this schema

Here are the **SQL `INSERT` statements** for the **Products**, **Customers**, and **Orders** tables based on the data you provided.
(I‚Äôve cleaned up product names that were split across lines.)

---

## **Insert Records into `Products`**

```sql
INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel: The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);
```

---

## **Insert Records into `Customers`**

```sql
INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');
```

---

## **Insert Records into `Orders`**

```sql
INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);
```

---

### ‚úÖ Everything checks out

* Foreign keys (`CategoryID`, `CustomerID`) match existing records
* Dates are in proper `YYYY-MM-DD` format
* Prices use `DECIMAL(10,2)`

If you want, I can now help you write **queries** (e.g., total orders per customer, products by category, top-selling categories, etc.).

# Question 7 : Generate a report showing CustomerName, Email, and the
# TotalNumberofOrders for each customer. Include customers who have not placed
# any orders, in which case their TotalNumberofOrders should be 0. Order the results
# by CustomerName.

Here‚Äôs the SQL query to generate the required report:

```sql
SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberOfOrders
FROM Customers c
LEFT JOIN Orders o
    ON c.CustomerID = o.CustomerID
GROUP BY
    c.CustomerID,
    c.CustomerName,
    c.Email
ORDER BY
    c.CustomerName;
```

### ‚úÖ Explanation

* **LEFT JOIN** ensures **all customers are included**, even those with no orders.
* `COUNT(o.OrderID)` counts only actual orders; customers with no orders get **0**.
* `GROUP BY` is required for aggregation.
* `ORDER BY CustomerName` sorts the report alphabetically.

This will correctly show customers like **Diana Prince** with `TotalNumberOfOrders = 0`.

If you want, I can also show the **expected output table** based on your current data.

## Question 8 : Retrieve Product Information with Category: Write a SQL query to
# **display the ProductName, Price, StockQuantity, and CategoryName for all**
# **products. Order the results by CategoryName and then ProductName alphabetically.**

Here‚Äôs the SQL query that retrieves **product information along with category names**, ordered as requested:

```sql
SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM Products p
INNER JOIN Categories c
    ON p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName ASC,
    p.ProductName ASC;
```

### ‚úÖ Explanation

* **INNER JOIN** links each product to its category.
* Selected columns match the required output:

  * `ProductName`
  * `Price`
  * `StockQuantity`
  * `CategoryName`
* Results are ordered:

  1. Alphabetically by **CategoryName**
  2. Alphabetically by **ProductName**

If you‚Äôd like, I can also show the **expected result table** based on your sample data or modify the query to include products without a category.

# Question 9 : Write a SQL query that uses a Common Table Expression (CTE) and a
# Window Function (specifically ROW_NUMBER() or RANK()) to display the
# CategoryName, ProductName, and Price for the top 2 most expensive products in
# each CategoryName.

Here‚Äôs a SQL query using a **CTE** and the **ROW_NUMBER() window function** to get the **top 2 most expensive products per category**:

```sql
WITH RankedProducts AS (
    SELECT
        p.ProductName,
        p.Price,
        c.CategoryName,
        ROW_NUMBER() OVER (
            PARTITION BY c.CategoryName
            ORDER BY p.Price DESC
        ) AS rn
    FROM Products p
    INNER JOIN Categories c
        ON p.CategoryID = c.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM RankedProducts
WHERE rn <= 2
ORDER BY
    CategoryName ASC,
    Price DESC;
```

---

### ‚úÖ Explanation

1. **CTE (`RankedProducts`)**:

   * Joins `Products` with `Categories` to get `CategoryName`.
   * Uses `ROW_NUMBER()` **partitioned by `CategoryName`** and **ordered by Price descending** to rank products within each category.

2. **Main Query**:

   * Filters `rn <= 2` to select the **top 2 most expensive products per category**.

3. **ORDER BY**:

   * Orders the results alphabetically by category and then by price within the category.

---

If you want, I can create the **expected output table** using your sample data‚Äîit‚Äôll show exactly which products appear in each category‚Äôs top 2.

Do you want me to do that?

# Question 10 : You are hired as a data analyst by Sakila Video Rentals, a global movie
# rental company. The management team is looking to improve decision-making by
nalyzing existing customer, rental, and inventory data.
Using the Sakila database, answer the following business questions to support key strategic
initiatives.
Tasks & Questions:
1. Identify the top 5 customers based on the total amount they‚Äôve spent. Include customer
name, email, and total amount spent.
2. Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.
3. Calculate how many films are available at each store and how many of those have
never been rented.
4. Show the total revenue per month for the year 2023 to analyze business seasonality.
# 5. Identify customers who have rented more than 10 times in the last 6 months.

Perfect! Let‚Äôs tackle these **Sakila database business questions** one by one with **SQL queries**. I‚Äôll assume standard Sakila schema names (`customer`, `payment`, `rental`, `inventory`, `film`, `film_category`, `category`, `store`).

---

## **1. Top 5 customers by total spending**

```sql
SELECT
    c.first_name || ' ' || c.last_name AS CustomerName,
    c.email,
    SUM(p.amount) AS TotalSpent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name, c.email
ORDER BY TotalSpent DESC
LIMIT 5;
```

**Explanation:**

* Joins `customer` with `payment` to sum total payments.
* Orders by total spent and limits to top 5.

---

## **2. Top 3 movie categories by rental counts**

```sql
SELECT
    cat.name AS CategoryName,
    COUNT(r.rental_id) AS RentalCount
FROM category cat
JOIN film_category fc ON cat.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY cat.category_id, cat.name
ORDER BY RentalCount DESC
LIMIT 3;
```

**Explanation:**

* Joins categories ‚Üí films ‚Üí inventory ‚Üí rentals.
* Counts total rentals per category.
* Orders descending to get the top 3.

---

## **3. Films available per store and number never rented**

```sql
SELECT
    s.store_id,
    COUNT(i.inventory_id) AS TotalFilms,
    COUNT(r.rental_id) FILTER (WHERE r.rental_id IS NULL) AS NeverRented
FROM store s
JOIN inventory i ON s.store_id = i.store_id
LEFT JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY s.store_id;
```

**Explanation:**

* `COUNT(i.inventory_id)` = total films per store
* `COUNT(r.rental_id) FILTER (WHERE r.rental_id IS NULL)` counts films never rented using a LEFT JOIN

> For MySQL, replace `FILTER` with:

```sql
SUM(CASE WHEN r.rental_id IS NULL THEN 1 ELSE 0 END) AS NeverRented
```

---

## **4. Total revenue per month for 2023**

```sql
SELECT
    DATE_FORMAT(p.payment_date, '%Y-%m') AS Month,
    SUM(p.amount) AS TotalRevenue
FROM payment p
WHERE YEAR(p.payment_date) = 2023
GROUP BY Month
ORDER BY Month;
```

**Explanation:**

* Groups payments by month for 2023
* Sums the total amount to see revenue per month

> For PostgreSQL, replace `DATE_FORMAT` with `TO_CHAR(p.payment_date, 'YYYY-MM')`.

---

## **5. Customers who rented more than 10 times in the last 6 months**

```sql
SELECT
    c.customer_id,
    c.first_name || ' ' || c.last_name AS CustomerName,
    c.email,
    COUNT(r.rental_id) AS RentalCount
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
WHERE r.rental_date >= CURRENT_DATE - INTERVAL '6 months'
GROUP BY c.customer_id, c.first_name, c.last_name, c.email
HAVING COUNT(r.rental_id) > 10
ORDER BY RentalCount DESC;
```

**Explanation:**

* Filters rentals in the last 6 months
* Groups by customer and counts rentals
* Uses `HAVING` to get customers with more than 10 rentals

---

I can also **combine all these queries into a single ‚Äúbusiness dashboard‚Äù view** for management if you want.

Do you want me to create that?